yokey1219/Nano103_BSP_CMSIS_v3.00.002/MyWork/UART_TxRx_Function/main.c
/******************************************************************************
 * @file     main.c
 * @version  V1.00
 * $Revision: 3 $
 * $Date: 15/12/18 2:07p $
 * @brief    Transmit and receive data from PC terminal through RS232 interface.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "Nano103.h"

#include "uart.h"

#define RXBUFSIZE 1024
#define PLLCON_SETTING      CLK_PLLCON_84MHz_HXT
#define PLL_CLOCK           84000000

/*---------------------------------------------------------------------------------------------------------*/
/* Global variables                                                                                        */
/*---------------------------------------------------------------------------------------------------------*/
struct _send_cmd
{
  uint16_t msgid;
  uint16_t cmdid;
  uint16_t datalen;
  uint8_t* data;
  struct _send_cmd * next;
};
typedef struct _send_cmd SendCMD;

uint8_t seriallen=0;
uint8_t* serialno;
SendCMD* phead=NULL;
SendCMD* ptail=NULL;
/*---------------------------------------------------------------------------------------------------------*/
/*For Uart0                                                                                                */
/*---------------------------------------------------------------------------------------------------------*/
uint8_t g_u8Uart0SendData[RXBUFSIZE] = {0};
uint8_t g_u8Uart0RecData[RXBUFSIZE]  = {0};
uint8_t g_serialno[20]={0};
uint8_t g_seriallen=0;

uint8_t g_u8Uart0SendDataini[5]={0xaa,0x01,0x0b,0x00,0x0a};
uint8_t g_u8Uart0SendDataque[4]={0xaa,0x00,0x04,0x04};
uint8_t g_u8Uart0SendDataNoReport[]={0xAA,0x14,0x02,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0x00,0xE9 };
volatile int32_t g_uart0binit=TRUE;
volatile int32_t g_uart0que=TRUE;
volatile uint32_t g_uart0myidx=0;

volatile uint32_t g_uart0sendhead=0;
volatile uint32_t g_uart0sendtail=0;

volatile uint32_t g_u32com0Rbytes = 0;
volatile uint32_t g_u32com0Rhead  = 0;
volatile uint32_t g_u32com0Rtail  = 0;
 

volatile uint32_t g_u32testcnt=0;


/*---------------------------------------------------------------------------------------------------------*/
/*For Uart1                                                                                                */
/*---------------------------------------------------------------------------------------------------------*/
uint8_t g_u8SendData[RXBUFSIZE] = {0};
uint8_t g_u8RecData[RXBUFSIZE]  = {0};

uint8_t g_u8SendDataini[12]={'A','T','+','N','B','A','N','D','?','\r','\n','\0'};
volatile int32_t g_binit=TRUE;

volatile uint32_t g_myidx=0;
volatile int32_t g_bsend=FALSE;
volatile uint32_t g_sendlen=0;
volatile uint32_t g_sendedidx=0;
volatile uint32_t g_sendhead=0;
volatile uint32_t g_sendtail=0;
volatile uint32_t g_step=0;

volatile uint32_t g_u32comRbytes = 0;
volatile uint32_t g_u32comRhead  = 0;
volatile uint32_t g_u32comRtail  = 0;
volatile int32_t g_bWait         = TRUE;
volatile int32_t g_i32pointer = 0;
volatile int32_t g_bInitaled    =FALSE;



volatile uint32_t g_transed=TRUE;
/*---------------------------------------------------------------------------------------------------------*/
/* Define functions prototype                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void);
void UART1_TEST_HANDLE(void);
void UART0_TEST_HANDLE(void);
void UART_FunctionTest(void);
void NBFunctionTest(uint8_t*,uint32_t);
void NBSendTrans(uint8_t* strs,int len);
void NBTransImmedite(uint8_t* strs,int len);
/**
 *  @brief  Init system clock and I/O multi function .
 *  @param  None
 *  @return None
 */
void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Enable External XTAL (4~24 MHz) */
    CLK->PWRCTL |= CLK_PWRCTL_HXTEN_Msk; // HXT Enabled

    /* Waiting for 12MHz clock ready */
    CLK_WaitClockReady( CLK_STATUS_HXTSTB_Msk);

    /* Switch HCLK clock source to XTAL */
    CLK->CLKSEL0 = (CLK->CLKSEL0 &~ CLK_CLKSEL0_HCLKSEL_Msk) | (CLK_CLKSEL0_HCLKSEL_HXT);

    /* Enable IP clock */
    CLK->APBCLK |= CLK_APBCLK_UART0_EN; // UART0 Clock Enable
    CLK->APBCLK |= CLK_APBCLK_UART1_EN; // UART1 Clock Enable

    /* Select IP clock source */
    CLK->CLKSEL1 &= ~CLK_CLKSEL1_UART0SEL_Msk;
    CLK->CLKSEL1 |= (0x0 << CLK_CLKSEL1_UART0SEL_Pos);// Clock source from external 12 MHz crystal clock
    CLK->CLKSEL2 &= ~CLK_CLKSEL2_UART1SEL_Msk;
    CLK->CLKSEL2 |= (0x0 << CLK_CLKSEL2_UART1SEL_Pos);// Clock source from external 12 MHz crystal clock

    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate PllClock, SystemCoreClock and CycylesPerUs automatically. */
    SystemCoreClockUpdate();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set PB multi-function pins for UART0 RXD and TXD  */
    SYS->GPB_MFPL &= ~(SYS_GPB_MFPL_PB0MFP_Msk|SYS_GPB_MFPL_PB1MFP_Msk|
                       SYS_GPB_MFPL_PB2MFP_Msk | SYS_GPB_MFPL_PB3MFP_Msk);
    SYS->GPB_MFPL |=  (SYS_GPB_MFPL_PB0MFP_UART0_RXD|SYS_GPB_MFPL_PB1MFP_UART0_TXD|
                      SYS_GPB_MFPL_PB2MFP_UART0_nRTS  | SYS_GPB_MFPL_PB3MFP_UART0_nCTS);

