yokey1219/Nano103_BSP_CMSIS_v3.00.002/MyWork/UART_TxRx_Function/main.c
    /* Set PB multi-function pins for UART1 RXD, TXD, RTS, CTS  */
    SYS->GPB_MFPL &= ~(SYS_GPB_MFPL_PB4MFP_Msk | SYS_GPB_MFPL_PB5MFP_Msk |
                       SYS_GPB_MFPL_PB6MFP_Msk | SYS_GPB_MFPL_PB7MFP_Msk);
    SYS->GPB_MFPL |= (SYS_GPB_MFPL_PB4MFP_UART1_RXD | SYS_GPB_MFPL_PB5MFP_UART1_TXD |
                      SYS_GPB_MFPL_PB6MFP_UART1_nRTS  | SYS_GPB_MFPL_PB7MFP_UART1_nCTS);

    /* Lock protected registers */
    SYS_LockReg();

}

/**
 *  @brief  Config UART0.
 *  @param  None
 *  @return None
 */
void UART0_Init()
{
    /* set uart baudrate is 115200 */
    UART_Open(UART0, 9600);
}

/**
 *  @brief  Config UART1.
 *  @param  None
 *  @return None
 */
void UART1_Init()
{
    /* set uart baudrate is 57600 */
    UART_Open(UART1, 9600);
}

/**
 *  @brief  main function.
 *  @param  None
 *  @return None
 */
int main(void)
{
    /* Init System, IP clock and multi-function I/O */
    SYS_Init();
    /* Init UART0 for printf */
    //UART0_Init();

    /* Init UART1 for test */
    UART1_Init();

    /*---------------------------------------------------------------------------------------------------------*/
    /* SAMPLE CODE                                                                                             */
    /*---------------------------------------------------------------------------------------------------------*/

    printf("\n\nCPU @ %dHz\n", SystemCoreClock);

    printf("+---------------------+\n");
    printf("| UART function test  |\n");
    printf("+---------------------+\n");

    /* Configure PB.14 as Output mode */
    GPIO_SetMode(PA, BIT14, GPIO_PMD_OUTPUT);
    /*---------------------------------------------------------------------------------------------------------*/
    /* UART Test Sample                                                                                        */
    /* It sends the received data to HyperTerminal.                                                            */
    /*---------------------------------------------------------------------------------------------------------*/
    UART_FunctionTest();

    while(!g_bInitaled);
    /* Infinite loop */
    while(1);
}


void UART0_IRQHandler(void)
{
    UART0_TEST_HANDLE();
}


void UART0_TEST_HANDLE()
{
  
    uint8_t u8InChar=0xFF;
    uint32_t u32IntSts= UART0->INTSTS;

    /* Check Receive Data */
    if(u32IntSts & UART_INTSTS_RDAIF_Msk) {
        printf("\nInput:");

        /* Get all the input characters */
        while(UART_IS_RX_READY(UART0)) {
            /* Get the character from UART Buffer */
            u8InChar = UART_READ(UART0);           /* Rx trigger level is 1 byte*/

            printf("%c ", u8InChar);
            /* Check if buffer full */
                if(1){//if(g_step>=2){//if(g_u32com0Rbytes < RXBUFSIZE) {
                    /* Enqueue the character */
                    g_u8Uart0RecData[g_u32com0Rtail] = u8InChar;
                    g_u32com0Rtail = (g_u32com0Rtail == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rtail+1);
                    //g_u32com0Rbytes++;
                    //g_u32testcnt++;
                }
    }
    }

     /* Check Tx empty */
    if(u32IntSts & UART_INTSTS_THREIF_Msk) {
           uint16_t tmp;
           tmp = g_uart0sendtail;
           if(g_uart0sendhead != tmp) {
               u8InChar = g_u8Uart0SendData[g_uart0sendhead];
            /* print the received char on screen */
               UART_WRITE(UART0,u8InChar);
               g_uart0sendhead = (g_uart0sendhead == (RXBUFSIZE-1)) ? 0 : (g_uart0sendhead+1);
            
          }
          else
          {
            UART_DISABLE_INT(UART0, ( UART_INTEN_THREIEN_Msk));
          }
        }
}

/**
 *  @brief ISR to handle UART Channel 1 interrupt event.
 *  @param[in] None
 *  @return None
 */
void UART1_IRQHandler(void)
{
    UART1_TEST_HANDLE();
}

/**
 *  @brief UART1 interrupt handle function.
 *  @param[in] None
 *  @return None
 */
void UART1_TEST_HANDLE()
{
    uint8_t u8InChar=0xFF;
    uint32_t u32IntSts= UART1->INTSTS;

    /* Check Receive Data */
    if(u32IntSts & UART_INTSTS_RDAIF_Msk) {
        printf("\nInput:");

        /* Get all the input characters */
        while(UART_IS_RX_READY(UART1)) {
            /* Get the character from UART Buffer */
            u8InChar = UART_READ(UART1);           /* Rx trigger level is 1 byte*/

            printf("%c ", u8InChar);
            
            {
                /* Check if buffer full */
                if(g_u32comRbytes < RXBUFSIZE) {
                    /* Enqueue the character */
                    g_u8RecData[g_u32comRtail] = u8InChar;
                    g_u32comRtail = (g_u32comRtail == (RXBUFSIZE-1)) ? 0 : (g_u32comRtail+1);
                    g_u32comRbytes++;
                }
                
                
            }
            if(u8InChar=='\n')
            {
                uint16_t tmp;
                uint8_t* p;
                uint32_t len;
                if(g_u32comRhead<g_u32comRtail)
                  len=g_u32comRtail-g_u32comRhead;
                else
                  len=RXBUFSIZE-g_u32comRhead+g_u32comRtail;
                p=(uint8_t*)malloc(len*sizeof(uint8_t));

                
                
                uint32_t idx=0;
                tmp = g_u32comRtail;
                while(g_u32comRhead != tmp) {
                   u8InChar = g_u8RecData[g_u32comRhead];
                   *(p+idx)=u8InChar;
                   g_u32comRhead = (g_u32comRhead == (RXBUFSIZE-1)) ? 0 : (g_u32comRhead+1);
                   g_u32comRbytes--;
                   idx++;
                }
                NBFunctionTest(p,len);
            }
           
        }
        printf("\nTransmission Test:");
    }

    /* Check Tx empty */
    if(u32IntSts & UART_INTSTS_THREIF_Msk) {
           uint16_t tmp;
           tmp = g_sendtail;
           if(g_sendhead != tmp) {
               u8InChar = g_u8SendData[g_sendhead];
            /* print the received char on screen */
               UART_WRITE(UART1,u8InChar);
               g_sendhead = (g_sendhead == (RXBUFSIZE-1)) ? 0 : (g_sendhead+1);
            
