yokey1219/Nano103_BSP_CMSIS_v3.00.002/MyWork/UART_TxRx_Function/main.c
          }
          else
          {
            UART_DISABLE_INT(UART1, ( UART_INTEN_THREIEN_Msk));
          }
        }
}



void NBFunctionTest(uint8_t* str,uint32_t len)
{
  if(len==2&&*str=='\r'&&*(str+1)=='\n')
  {
  }
  else
     if(len==4&&*str=='O'&&*(str+1)=='K')
    {
      
    }
    else
  if(len>=8)
  {
    if(*str=='+'&&*(str+1)=='N'&&*(str+2)=='B')
    {
      NBSendTrans("AT+CFUN?\r\n",10);
    }
    else if(*str=='+'&&*(str+1)=='C'&&*(str+2)=='F'&&*(str+3)=='U'&&*(str+4)=='N')
    {
      NBSendTrans("AT+CGATT?\r\n",11);
    }
    else if(*str=='+'&&*(str+1)=='C'&&*(str+2)=='G'&&*(str+3)=='A'&&*(str+4)=='T'&&*(str+5)=='T'&&*(str+6)==':'&&*(str+7)!='1')
    {
      
    }
    else if(*str=='+'&&*(str+1)=='C'&&*(str+2)=='G'&&*(str+3)=='A'&&*(str+4)=='T'&&*(str+5)=='T'&&*(str+6)==':'&&*(str+7)=='1')
    {
       g_seriallen=0;
       NBSendTrans("AT+CIMI\r\n",9);
       //NBSendTrans("AT+NSOCR=DGRAM,17,5684,1\r\n",26);
       g_step=1;
    }
    else if (*str=='+'&&*(str+1)=='N'&&*(str+2)=='S'&&*(str+3)=='O'&&*(str+4)=='N'&&*(str+5)=='M'&&*(str+6)=='I'&&*(str+7)==':')  //+NSONMI:0,40
    {
        //AT+NSORF=0,4
        char s[100]={0};
        int ci=0;
        while(ci<99&&ci<(len-8))
        {
          s[ci]=*(str+8+ci);
          ci++;
        }
        s[ci<99?ci:99]='\0';
        
        char word[100]="AT+NSORF=";
        char *end="\r\n";
        strcat(word,s);
        strcat(word,end);
        
        NBSendTrans((uint8_t*)word,11+ci);
    }
    else
    if(g_step==1)
    {
      while(*(str+g_seriallen)!='\r'&&g_seriallen<20)
      {
        g_serialno[g_seriallen]=*(str+g_seriallen);
        g_seriallen+=1;
      }
      if(g_seriallen>=20) g_seriallen=19;
      g_serialno[g_seriallen]='\0';
      NBSendTrans("AT+NSOCR=DGRAM,17,5684,1\r\n",26);
      g_step=2;
    }
  }
  else
  {
    if(g_step==2&&*str=='0')
    { 
      g_step=3;
      g_transed=FALSE;
    }
    else
    if(len==7&&*str=='E'&&*(str+1)=='R'&&*(str+2)=='R')
      {
        
        g_step=1;
        g_transed=TRUE;
      }
  }
  free(str);
}

void NBSendTrans(uint8_t* strs,int len)
{
  
 
  int i=0;
  //int len=sizeof(strs)/sizeof(uint8_t)-1;
  //while(g_bsend)
  //  ;
  for(;i<len;i++)
  {
     g_u8SendData[g_sendtail] =*(strs+i);
     g_sendtail = (g_sendtail == (RXBUFSIZE-1)) ? 0 : (g_sendtail+1);
  }
  g_u8SendData[g_sendtail]=0;
  g_sendtail = (g_sendtail == (RXBUFSIZE-1)) ? 0 : (g_sendtail+1);
   UART_ENABLE_INT(UART1, ( UART_INTEN_THREIEN_Msk));
}


void NBTransImmedite(uint8_t* strs,int len)
{
  /*for(int i=0;i<len;i++)
    UART_WRITE(UART1,*(strs+i));
  UART_WRITE(UART1,'\0');*/
}


void DCSendTrans(uint8_t* strs,int len)
{
  int i=0;
  for(;i<len;i++)
  {
     g_u8Uart0SendData[g_uart0sendtail] =*(strs+i);
     g_uart0sendtail = (g_uart0sendtail == (RXBUFSIZE-1)) ? 0 : (g_uart0sendtail+1);
  }
  g_u8Uart0SendData[g_uart0sendtail]=0;
  g_uart0sendtail = (g_uart0sendtail == (RXBUFSIZE-1)) ? 0 : (g_uart0sendtail+1);
   UART_ENABLE_INT(UART0, ( UART_INTEN_THREIEN_Msk));
}

void DCSendTransByte(uint8_t bytes[],int len)
{
    int i=0;
    //int len=(sizeof(bytes) / sizeof(bytes[0]));
    for(;i<len;i++)
    {
        g_u8Uart0SendData[g_uart0sendtail] =bytes[i];
        g_uart0sendtail = (g_uart0sendtail == (RXBUFSIZE-1)) ? 0 : (g_uart0sendtail+1);
        UART_ENABLE_INT(UART0, ( UART_INTEN_THREIEN_Msk));
    }
}

void NBSendCmd(uint16_t cmdid,uint8_t data[],uint16_t datalen)
{
  SendCMD* cmd=(SendCMD*)malloc(sizeof(SendCMD));
  if(phead==NULL)
  {
    cmd->msgid=0;
    phead=cmd;
    ptail=cmd;
  }
  else
  {
    uint16_t _msgid;
    _msgid=ptail->msgid>65535?0:ptail->msgid+1;
    cmd->msgid=_msgid;
    ptail->next=cmd;
    ptail=cmd;
  }
    cmd->cmdid=cmdid;
    cmd->data=data;
    cmd->datalen=datalen;
    //uint8_t* transdata=(uint8_t*)malloc(sizeof(uint8_t)*(2+2+1+g_seriallen+2+datalen));
    uint16_t transdatalen=2+2+1+g_seriallen+2+datalen;
    char transdata[100]={0};
    sprintf(transdata,"AT+NSOST=0,119.23.12.86,8081,%d,",transdatalen);
    char tmpbyte[3]={0};
    sprintf(tmpbyte,"%X",cmd->msgid>>8);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
    
    sprintf(tmpbyte,"%X",cmd->msgid&0x00ff);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
    
    
    sprintf(tmpbyte,"%X",cmdid>>8);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
    
    sprintf(tmpbyte,"%X",cmdid&0x00ff);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
    
    sprintf(tmpbyte,"%X",g_seriallen);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
    
    int i=0;
    for(;i<g_seriallen;i++)
    { 
      sprintf(tmpbyte,"%X",g_serialno[i]);
      if(strlen(tmpbyte)==1)
      {
        strcat(transdata,"0");
      }
      strcat(transdata,tmpbyte);
    } 
    
    uint16_t totallen=strlen(transdata)+transdatalen+2;
    
   
     sprintf(tmpbyte,"%X",datalen>>8);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
    
    sprintf(tmpbyte,"%X",datalen&0x00ff);
    if(strlen(tmpbyte)==1)
    {
      strcat(transdata,"0");
    }
    strcat(transdata,tmpbyte);
   
    strcat(transdata,(char*)data);
    strcat(transdata,"\r\n");
    NBSendTrans((uint8_t*)transdata,totallen);
    
}


/**
 *  @brief The function is UART demo code.
 *  @param[in] None
 *  @return None
 */
void UART_FunctionTest()
{
    printf("+-----------------------------------------------------------+\n");
    printf("|  UART Function Test                                       |\n");
    printf("+-----------------------------------------------------------+\n");
    printf("|  Description :                                            |\n");
    printf("|    The sample code will print input char on terminal      |\n");
    printf("|    Please enter any to start     (Press '0' to exit)      |\n");
    printf("+-----------------------------------------------------------+\n");

