yokey1219/Nano103_BSP_CMSIS_v3.00.002/MyWork/UART_TxRx_Function/main.c
    /*
        Using a RS232 cable to connect UART1 and PC.
        UART0 is set to debug port. UART1 is enable RDA and RLS interrupt.
        When inputting char to terminal screen, RDA interrupt will happen and
        UART1 will print the received char on screen.
    */

    /* Enable Interrupt */
    //UART_ENABLE_INT(UART0, (UART_INTEN_RDAIEN_Msk | UART_INTEN_THREIEN_Msk | UART_INTEN_RXTOIEN_Msk));
    //UART_ENABLE_INT(UART1, (UART_INTEN_RDAIEN_Msk | UART_INTEN_THREIEN_Msk | UART_INTEN_RXTOIEN_Msk));
    UART0_Init();
    UART_ENABLE_INT(UART0, (UART_INTEN_RDAIEN_Msk | UART_INTEN_RXTOIEN_Msk));
    NVIC_EnableIRQ(UART0_IRQn);
    
    
    //quit sleep
    PC0=0;
    DCSendTransByte(g_u8Uart0SendDataNoReport,24);
    
    
    UART_ENABLE_INT(UART1, (UART_INTEN_RDAIEN_Msk | UART_INTEN_RXTOIEN_Msk));
    
    NBSendTrans("AT+CGATT?\r\n",11);
    NVIC_EnableIRQ(UART1_IRQn);
    //NBTransImmedite("AT+NBAND?\r\n",11);
    uint32_t cnt=0;
    while(g_step<3)
    {
      PA14 = 0;
      CLK_SysTickDelay(50000);
      PA14 = 1;
      CLK_SysTickDelay(50000);
      cnt++;
      if(cnt>30)
      {
         NBSendTrans("AT+CGATT?\r\n",11);
         cnt=0;
      }
    }
    cnt=0;
    
    //enter sleep
    //PC0=1;
    
    while(g_step!=3)
    {
      
      PA14 = 0;
      CLK_SysTickDelay(2000000);
      if(g_transed)
      {
          NBSendTrans("AT+NSOCR=DGRAM,17,5684,1\r\n",26);
          g_transed=FALSE;
      }
      PA14 = 1;
      CLK_SysTickDelay(2000000);
    }
   
    uint8_t stadata[3]={0};
    
    while(g_bWait)
    {
          PA14 = 0;
          
               uint32_t len;
                if(g_u32com0Rhead<g_u32com0Rtail)
                  len=g_u32com0Rtail-g_u32com0Rhead;
                else
                  len=RXBUFSIZE-g_u32com0Rhead+g_u32com0Rtail;
           if(len>3)
              {
                
                
                while(g_u8Uart0RecData[g_u32com0Rhead]!=0xaa) 
                {
                  g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                  //if(g_u32com0Rhead>=g_u32com0Rtail) break;
                  if(g_u32com0Rhead<g_u32com0Rtail)
                    len=g_u32com0Rtail-g_u32com0Rhead;
                  else
                    len=RXBUFSIZE-g_u32com0Rhead+g_u32com0Rtail;
                  if(len==0) break;
                }
                if(len>0)
                {
                  
               
                      //if(len<3) continue;
                      //uint16_t tmp;
                      //uint32_t idx=0;
                      
                      g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                      uint8_t cmdlen=g_u8Uart0RecData[g_u32com0Rhead];
                      g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                      uint8_t cmd=g_u8Uart0RecData[g_u32com0Rhead];
                      if(cmd==0x03)
                      {
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           uint8_t sta=g_u8Uart0RecData[g_u32com0Rhead];
                           /*if(sta==0x00)
                           {
                             //NBSendTrans("AT+NSOST=0,119.23.12.86,8081,3,303030\r\n",39);
                             stadata[0]=0;
                             NBSendCmd(1,&stadata);
                           }
                            else if(sta==0x01)
                           {
                             //NBSendTrans("AT+NSOST=0,119.23.12.86,8081,3,313131\r\n",39);
                             stadata
                             NBSendCmd(1,{1});
                           }
                           else
                           {
                             NBSendTrans("AT+NSOST=0,119.23.12.86,8081,3,323232\r\n",39);
                             NBSendCmd(1,{sta});
                           }*/
                           sprintf(stadata,"%x",sta);
                           if(strlen(stadata)==1)
                           {
                             stadata[1]=stadata[0];
                             stadata[0]='0';
                           }
                           NBSendCmd(1,stadata,1);
                           
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           //g_uart0que=TRUE;
                      }
                      else if(cmd==0x00)
                      {
                           g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                           uint8_t sta=g_u8Uart0RecData[g_u32com0Rhead];
                           if(sta==0x00)
                           {
                             PC0=1;
                           }
                      }
                      else
                      {
                        uint8_t i=0;
                        for(;i<cmdlen;i++)
                        {
                          g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                        }
                        g_u32com0Rhead = (g_u32com0Rhead == (RXBUFSIZE-1)) ? 0 : (g_u32com0Rhead+1);
                      }
                }
              }   
              //else
              //{
                CLK_SysTickDelay(500000);
              //}
           PA14 = 1;
           CLK_SysTickDelay(500000);
    } // wait user press '0' to exit test

    /* Disable Interrupt */
    UART_DISABLE_INT(UART0, (UART_INTEN_RDAIEN_Msk | UART_INTEN_THREIEN_Msk | UART_INTEN_RXTOIEN_Msk));
    NVIC_DisableIRQ(UART0_IRQn);
    UART_DISABLE_INT(UART1, (UART_INTEN_RDAIEN_Msk | UART_INTEN_THREIEN_Msk | UART_INTEN_RXTOIEN_Msk));
    NVIC_DisableIRQ(UART1_IRQn);
    g_bWait =TRUE;
    printf("\nUART Sample Demo End.\n");

}


